#ifndef _LOG_IN_H_
#define _LOG_IN_H_
#include "..\\List\List.h"
#include "..\\Staff\staff.h"
#include "..\\File\File.h"
#include "..\\Waiter\Order.h"
#include "..\\Glb_putstring\\Glb_putstring.h"

/************************************************************************
* 函数名称：void JR_EmptyRaw(int r1,int r2)
* 功能描述：
           清空指定行的函数
* 参数说明：
*    int r1    开始行
     int r2	   结束行
* 返回值：
*        无
*************************************************************************/
void JR_EmptyRaw(int r1,int r2);

/************************************************************************
* 函数名称：int Log_in(pList head)
* 功能描述：
           登录函数
* 参数说明：
*    pList head    员工链表的头指针	 
* 返回值：
*        员工的角色标志
*************************************************************************/
int Log_in(pList head);

/************************************************************************
* 函数名称：void JR_SetCursor(int x, int y)
* 功能描述：
           光标定位函数
* 参数说明：
*    int x   行坐标
     int y   列坐标
* 返回值：
*        无
*************************************************************************/
void JR_SetCursor(int x, int y);

/************************************************************************
* 函数名称：void Login_init(FILE *fp,pList head)
* 功能描述：
           登录初始化函数，创建管理员admin用户
* 参数说明：
*    FILE *fp    员工文件指针
     pList head  员工链表的头指针    
* 返回值：
*        无
*************************************************************************/
void Login_init(FILE *fp,pList head);

#endif
